;#------------------------------------------------------------------------------
;#【注意】
;#	1、}与后面的非空字符，必须留有空白，
;#		例如，下列代码第二行: } {
;#		      下列代码第四行: } else
;#			否则报错如下：
;#			extra characters after close-brace
;#				while executing
;#			"if { $x == 2 }{"
;#				(file "009.tcl" line 2)
;#
;#	2、if与后面的{之间，必须留有空白，否则报错如下：
;#			invalid command name "if{1"
;#				while executing
;#			"if{$x == 2} {
;#					puts "$x is != 1"
;#			} else {
;#					puts "$x is 1"
;#			}"
;#				(file "009.tcl" line 2)
;#------------------------------------------------------------------------------


set x 1
if {$x == 2} {
	puts "$x is != 1"
} else {
	puts "$x is 1"
}


;#------------------------------------------------------------------------------
;# 【注意】
;# 		在if条件式中$$y进行了二次置换
;# 		在puts命令中，只进行了一次置换
;#------------------------------------------------------------------------------
set y x
if "$$y != 1" {
	puts "$$y is != 1"
} else {
	puts "$$y is 1"
}